/* https://opensource.com/article/19/5/how-write-good-c-main-function
 * https://linux.cn/article-10949-1.html
 * main() 函数是开始执行时所执行的程序的第一个函数，但不是第一个执行的函数。
 * 第一个函数是 _start()，它通常由 C 运行库提供，在编译程序时自动链入。
 * 此细节高度依赖于操作系统和编译器工具链，所以我假装没有提到它。
 * main() 函数有两个参数，通常称为 argc 和 argv，并返回一个有符号整数.
 * 大多数 Unix 环境都希望程序在成功时返回 0（零），失败时返回 -1（负一）.
 * ==============================================================
 * 参数       名称      描述
 * argc     参数个数    参数向量的个数
 * argv     参数向量    字符指针数组
 * ==============================================================
 *
 */

/* main.c */
/* 0 版权/许可证 */
/* 1 包含 */
/* 2 定义 */
/* 3 外部声明 */
/* 4 类型定义 */
/* 5 全局变量声明 */
/* 6 函数原型 */


int main(int argc, char *argv[]) {
/* 7 命令行解析 */
}


/* 8 函数声明 */













